index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-17 Wed 09:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wofi Configuration</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Wofi Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga47c1fc">Wofi</a>
<ul>
<li><a href="#orgda6413f">config</a></li>
<li><a href="#org131891d">style</a></li>
</ul>
</li>
<li><a href="#orgd426427">wofi-power-menu</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga47c1fc" class="outline-2">
<h2 id="orga47c1fc">Wofi</h2>
<div class="outline-text-2" id="text-orga47c1fc">
</div>
<div id="outline-container-orgda6413f" class="outline-3">
<h3 id="orgda6413f">config</h3>
<div class="outline-text-3" id="text-orgda6413f">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #b8860b;">insensitive</span> = true
<span style="color: #b8860b;">term</span>=alacritty
<span style="color: #b8860b;">key_up</span>=Up,Ctrl-p,Ctrl-k
<span style="color: #b8860b;">key_down</span>=Down,Ctrl-n,Ctrl-j
<span style="color: #b8860b;">key_left</span>=Left,Ctrl-b
<span style="color: #b8860b;">key_right</span>=Right,Ctrl-f
<span style="color: #b8860b;">key_pgup</span>=Page_Up,Alt-v
<span style="color: #b8860b;">key_pgdn</span>=Page_Down,Ctrl-f
<span style="color: #b8860b;">key_exit</span>=Escape,Ctrl-g,Ctrl-bracketleft
<span style="color: #b8860b;">matching</span>=fuzzy
<span style="color: #b8860b;">allow_image</span>=true
<span style="color: #b8860b;">allow_markup</span>=true
<span style="color: #b8860b;">gtk_dark</span>=true
<span style="color: #b8860b;">dynamic_lines</span>=false
<span style="color: #b8860b;">close_on_focus_loss</span>=true
<span style="color: #b8860b;">single_click</span>=true
<span style="color: #b8860b;">height</span>=30%
<span style="color: #b8860b;">width</span>=30%
<span style="color: #b8860b;">columns</span>=1
<span style="color: #b8860b;">prompt</span>=PROMPT
</pre>
</div>
</div>
</div>
<div id="outline-container-org131891d" class="outline-3">
<h3 id="org131891d">style</h3>
<div class="outline-text-3" id="text-org131891d">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #00008b;">@define-color</span> color0  <span style="color: #ffffff; background-color: #073642;">#073642</span>;
<span style="color: #00008b;">@define-color</span> color1  <span style="color: #ffffff; background-color: #dc322f;">#dc322f</span>;
<span style="color: #00008b;">@define-color</span> color2  <span style="color: #000000; background-color: #859900;">#859900</span>;
<span style="color: #00008b;">@define-color</span> color3  <span style="color: #000000; background-color: #b58900;">#b58900</span>;
<span style="color: #00008b;">@define-color</span> color4  <span style="color: #000000; background-color: #268bd2;">#268bd2</span>;
<span style="color: #00008b;">@define-color</span> color5  <span style="color: #ffffff; background-color: #d33682;">#d33682</span>;
<span style="color: #00008b;">@define-color</span> color6  <span style="color: #000000; background-color: #2aa198;">#2aa198</span>;
<span style="color: #00008b;">@define-color</span> color7  <span style="color: #000000; background-color: #eee8d5;">#eee8d5</span>;
<span style="color: #00008b;">@define-color</span> color8  <span style="color: #ffffff; background-color: #6c7c80;">#6c7c80</span>;
<span style="color: #00008b;">@define-color</span> color9  <span style="color: #ffffff; background-color: #dc322f;">#dc322f</span>;
<span style="color: #00008b;">@define-color</span> color10  <span style="color: #000000; background-color: #859900;">#859900</span>;
<span style="color: #00008b;">@define-color</span> color11  <span style="color: #000000; background-color: #b58900;">#b58900</span>;
<span style="color: #00008b;">@define-color</span> color12  <span style="color: #000000; background-color: #268bd2;">#268bd2</span>;
<span style="color: #00008b;">@define-color</span> color13  <span style="color: #ffffff; background-color: #d33682;">#d33682</span>;
<span style="color: #00008b;">@define-color</span> color14  <span style="color: #000000; background-color: #2aa198;">#2aa198</span>;
<span style="color: #00008b;">@define-color</span> color15  <span style="color: #000000; background-color: #eee8d5;">#eee8d5</span>;
<span style="color: #00008b;">@define-color</span> color16 <span style="color: #ffffff; background-color: #3b4252;">#3b4252</span>;
<span style="color: #00008b;">@define-color</span> color17 <span style="color: #ffffff; background-color: #2e3440;">#2e3440</span>;
<span style="color: #00008b;">@define-color</span> color18 <span style="color: #ffffff; background-color: #434c5e;">#434c5e</span>;
<span style="color: #00008b;">@define-color</span> color19 <span style="color: #ffffff; background-color: #4c566a;">#4c566a</span>;
<span style="color: #00008b;">@define-color</span> color20 <span style="color: #ffffff; background-color: #434c5e;">#434c5e</span>;
<span style="color: #00008b;">@define-color</span> color21 <span style="color: #000000; background-color: #d8dee9;">#d8dee9</span>;
<span style="color: #00008b;">@define-color</span> color22 <span style="color: #000000; background-color: #e5e9f0;">#e5e9f0</span>;
<span style="color: #00008b;">@define-color</span> color23 <span style="color: #000000; background-color: #eceff4;">#eceff4</span>;
<span style="color: #00008b;">@define-color</span> color24 <span style="color: #000000; background-color: #8fbcbb;">#8fbcbb</span>;
<span style="color: #00008b;">@define-color</span> color25 <span style="color: #000000; background-color: #88c0d0;">#88c0d0</span>;
<span style="color: #00008b;">@define-color</span> color26 <span style="color: #000000; background-color: #81a1c1;">#81a1c1</span>;
<span style="color: #00008b;">@define-color</span> color27 <span style="color: #000000; background-color: #5e81ac;">#5e81ac</span>;
<span style="color: #00008b;">@define-color</span> color28 <span style="color: #ffffff; background-color: #bf616a;">#bf616a</span>;
<span style="color: #00008b;">@define-color</span> color29 <span style="color: #000000; background-color: #d08770;">#d08770</span>;
<span style="color: #00008b;">@define-color</span> color30 <span style="color: #000000; background-color: #ebcb8b;">#ebcb8b</span>;
<span style="color: #00008b;">@define-color</span> color31 <span style="color: #000000; background-color: #a3be8c;">#a3be8c</span>;
<span style="color: #00008b;">@define-color</span> color32 <span style="color: #ffffff; background-color: #b48ead;">#b48ead</span>;

<span style="color: #0000ff;">window</span> {
    <span style="color: #4169e1;">margin</span>: 0px;
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">border: 1px solid #928374;</span><span style="color: #b22222;"> */</span>
    <span style="color: #4169e1;">border</span>: 1px solid <span style="color: #00008b;">@color18</span>;
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@color17</span>;
}

<span style="color: #0000ff;">#input</span> {
    <span style="color: #4169e1;">margin</span>: 5px;
    <span style="color: #4169e1;">border</span>: none;
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@color23</span>;
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@color16</span>;
}

<span style="color: #0000ff;">#inner-box</span> {
    <span style="color: #4169e1;">margin</span>: 5px;
    <span style="color: #4169e1;">border</span>: none;
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@color16</span>;
}

<span style="color: #0000ff;">#outer-box</span> {
    <span style="color: #4169e1;">margin</span>: 5px;
    <span style="color: #4169e1;">border</span>: none;
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@color16</span>;
}

<span style="color: #0000ff;">#scroll</span> {
    <span style="color: #4169e1;">margin</span>: 0px;
    <span style="color: #4169e1;">border</span>: none;
}

<span style="color: #0000ff;">#text</span> {
    <span style="color: #4169e1;">margin</span>: 5px;
    <span style="color: #4169e1;">border</span>: none;
    <span style="color: #4169e1;">color</span>: <span style="color: #00008b;">@color23</span>;
}

#entry:selected {
    <span style="color: #4169e1;">background-color</span>: <span style="color: #00008b;">@color29</span>;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd426427" class="outline-2">
<h2 id="orgd426427">wofi-power-menu</h2>
<div class="outline-text-2" id="text-orgd426427">
<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #228b22;">wofi</span>]
  <span style="color: #b8860b;">extra_args</span> = <span style="color: #bc8f8f;">"--allow-markup --columns=1 --hide-scroll -W 15% --location=top_right --hide-search -x -30"</span>

[<span style="color: #228b22;">menu.shutdown</span>]
  <span style="color: #b8860b;">cmd</span> = <span style="color: #bc8f8f;">"systemctl poweroff"</span>

[<span style="color: #228b22;">menu.reboot</span>]
  <span style="color: #b8860b;">cmd</span> = <span style="color: #bc8f8f;">"systemctl reboot"</span>

[<span style="color: #228b22;">menu.suspend</span>]
  <span style="color: #b8860b;">enabled</span> = <span style="color: #bc8f8f;">"false"</span>

[<span style="color: #228b22;">menu.hibernate</span>]
  <span style="color: #b8860b;">enabled</span> = <span style="color: #bc8f8f;">"false"</span>
  <span style="color: #b8860b;">cmd</span> = <span style="color: #bc8f8f;">"systemctl hybernate"</span>

[<span style="color: #228b22;">menu.logout</span>]
  <span style="color: #b8860b;">cmd</span> = <span style="color: #bc8f8f;">"hyprctl dispatch exit"</span>

[<span style="color: #228b22;">menu.lock-screen</span>]
  <span style="color: #b8860b;">cmd</span> = <span style="color: #bc8f8f;">"hyprlock"</span>
  <span style="color: #b8860b;">requires_confirmation</span> = <span style="color: #bc8f8f;">"false"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-09-17 Wed 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2025-09-17 Wed 09:40</p>
</div>
</body>
</html>
